Revit 2027 API
FabricationNetworkChangeService.GetDeletePartFailureState Method
 Get the state if the element will be deleted when change the service encounters an error or not.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool GetDeletePartFailureState()
Public Function GetDeletePartFailureState As Boolean
public:
bool GetDeletePartFailureState()
member GetDeletePartFailureState : unit -> bool
Return Value
Boolean
 Returns true if if the element will be deleted otherwise false.
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace